#include <stdio.h>
#include <stdlib.h>
//Основна бібліотека для роботи математичних розрахунків
#include <math.h>
#define Name "Misha"
#define LastName "Kreys"
#define GroupName "RB-61"
#define Faculty "RTF"
#define University "Igor Sikorsky KPI"
//Основне тіло програми
int main(){
//Оголошення двух змінних X Y
double x, y; //
//Виводиться шапка програми
printf("%s", University);
printf("\nFaculty: %s", Faculty);
printf("\nGroup: %s", GroupName);
printf("\nstudent: %s %s", Name, LastName);
printf("\n----------------------------------------\n");

printf("Enter x: ");
    scanf("%lf", &x);
//Після введення X за допомогою оператору розгалуження виконується программа
if (x >= -5.0 && x < 0.0)//За допомогою логічного І виконується перевірка значення X якщо X більше або дорівнює -5.0 І X меньше за 0
    {y = x * x + 2.0 * x + 1.0;}//виконується математичне числення за умови справдження оператору розгалудження IF

    else if (x >= 0.0 && x < 10.0)
    //Після виконування оператору розгалудження з математичним численням або його спростування
    //Виконується оператор ELSE IF перевіряючи значення X тим же чином
    {y = 1.0 / sqrt(x + 1.0);}//Після виконується математичне числення
    //Якщо інші функції виконались або спростувались виконується останній цикл розгалуження
    //Так само за допомогою логічного І перевіряється значення X
    else if (x >= 10.0 && x < 1000.0)
    {y = log10(x) + 2.0 * x;} //Виконання математичне числення
    //В кінці останній оператор розгалуження  з математичним численням відповідь з якого виводиться на 38 рядок де на екран виводиться відповідь
    else {y = x / 2.0;}
printf("\n***************");
printf("\nResult: x = %.4lf ==> y = %.6lf\n", x, y);
printf("***************\n");

return 0;
//Кінець програми
}
